<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>小朋友的编程(一) | YongSir | 专业程序员伪装者</title>

  
  <meta name="author" content="13hoop">
  

  
  <meta name="description" content="&amp;#x7B2C;0&amp;#x7AE0; &amp;#x5F15;&amp;#x5B50;&amp;#x4F60;&amp;#x4E00;&amp;#x5B9A;&amp;#x5BF9;&amp;#x7535;&amp;#x8111;&amp;#x548C;&amp;#x624B;&amp;#x673A;&amp;#x7684;&amp;#x4F7F;&amp;#x7528;&amp;#x975E;&amp;#x5E38;&amp;#x7">
  

  
  
  <meta name="keywords" content="">
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="小朋友的编程(一)"/>

  <meta property="og:site_name" content="YongSir"/>

  
  <meta property="og:image" content="/favicon.ico"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="YongSir" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
</head>


<body>
<div class="blog">
  <div class="content">

    <header>
  <div class="site-branding">
    <h1 class="site-title">
      <a href="/">YongSir</a>
    </h1>
    <p class="site-description">专业程序员伪装者</p>
  </div>
  <nav class="site-navigation">
    <ul>
      
        <li><a href="/">主页</a></li>
      
        <li><a href="/archives">归档</a></li>
      
    </ul>
  </nav>
</header>

    <main class="site-main posts-loop">
    <article>

  
    
    <h3 class="article-title"><span>小朋友的编程(一)</span></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/2017/09/16/小朋友的编程-一/" rel="bookmark">
        <time class="entry-date published" datetime="2017-09-16T09:56:27.000Z">
          2017-09-16
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <h2 id="&#x7B2C;0&#x7AE0;-&#x5F15;&#x5B50;"><a href="#&#x7B2C;0&#x7AE0;-&#x5F15;&#x5B50;" class="headerlink" title="&#x7B2C;0&#x7AE0; &#x5F15;&#x5B50;"></a>&#x7B2C;0&#x7AE0; &#x5F15;&#x5B50;</h2><p>&#x4F60;&#x4E00;&#x5B9A;&#x5BF9;&#x7535;&#x8111;&#x548C;&#x624B;&#x673A;&#x7684;&#x4F7F;&#x7528;&#x975E;&#x5E38;&#x719F;&#x6089;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x4F60;&#x51E0;&#x4E4E;&#x5929;&#x5929;&#x5728;&#x505A;&#xFF1A;</p>
<ul>
<li>&#x6253;&#x5F00;&#x7535;&#x8111;&#xFF0C;&#x5C4F;&#x5E55;&#x4EAE;&#x8D77;&#xFF0C;&#x7B49;&#x5F85;&#x4E00;&#x5C0F;&#x6BB5;&#x65F6;&#x95F4;&#xFF08;&#x6216;&#x8BB8;&#x4F60;&#x77E5;&#x9053;&#x8FD9;&#x662F;&#x5728;&#x542F;&#x52A8;&#x7CFB;&#x7EDF;&#xFF09;&#xFF0C;&#x76F4;&#x5230;&#x51FA;&#x73B0;&#x684C;&#x9762;</li>
<li>&#x70B9;&#x51FB;&#x6E38;&#x620F;&#x56FE;&#x6807;&#xFF0C;&#x8FDB;&#x5165;&#x6E38;&#x620F;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x5FC3;&#x7684;&#x73A9;&#x6E38;&#x620F;&#x4E86;</li>
<li>&#x70B9;&#x51FB;QQ&#xFF0C;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#x548C;&#x8D26;&#x53F7;&#xFF0C;&#x70B9;&#x51FB;&#x597D;&#x53CB;&#x56FE;&#x50CF;&#xFF0C;&#x5C31;&#x80FD;&#x5728;&#x5F39;&#x51FA;&#x7684;&#x5BF9;&#x8BDD;&#x6846;&#x4E2D;&#x901A;&#x8FC7;&#x6253;&#x5B57;&#x3001;&#x8BED;&#x97F3;&#x6216;&#x8005;&#x89C6;&#x5C4F;&#x8DDF;&#x597D;&#x53CB;&#x804A;&#x5929;&#x4E86;</li>
<li>&#x5230;&#x8D85;&#x5E02;&#x4E70;&#x4E1C;&#x897F;&#xFF0C;&#x6253;&#x5F00;&#x624B;&#x673A;&#x626B;&#x4E00;&#x626B;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x4ED8;&#x6B3E;</li>
<li>&#x518D;&#x56DE;&#x5FC6;&#x4E00;&#x4E2A;&#x627E;&#x52A8;&#x753B;&#x7247;&#x7684;&#x4F8B;&#x5B50;&#xFF1A; &#x6253;&#x5F00;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x8F93;&#x5165;www.baidu.com&#x5C31;&#x5230;&#x4E86;&#x767E;&#x5EA6;&#x7684;&#x9996;&#x9875;&#xFF0C;&#x901A;&#x8FC7;&#x767E;&#x5EA6;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x52A8;&#x753B;&#x7247;&#xFF0C;&#x6BD4;&#x5982;&#x201C;&#x706B;&#x5F71;&#x5FCD;&#x8005;&#x201D;&#xFF0C;&#x5728;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x4E2D;&#x627E;&#x5230;&#x571F;&#x8C46;&#x7F51;&#xFF0C;&#x70B9;&#x51FB;&#x5B83;&#xFF0C;&#x7B49;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x7ED3;&#x675F;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x52A8;&#x753B;&#x7247;&#x4E86;   </li>
</ul>
<p>&#x4E0A;&#x8FF0;&#x4F60;&#x4E00;&#x5B9A;&#x975E;&#x5E38;&#x719F;&#x7EC3;&#xFF0C;&#x5BF9;&#x5427;</p>
<p>&#x4F46;&#x662F;&#x4F60;&#x6CA1;&#x6709;&#x597D;&#x5947;&#x8FC7;&#x8FD9;&#x4E00;&#x5207;&#x662F;&#x600E;&#x4E48;&#x53D1;&#x751F;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x80CC;&#x540E;&#x7684;&#x539F;&#x7406;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x7535;&#x8111;&#x7A76;&#x7ADF;&#x6709;&#x4EC0;&#x4E48;&#x9B54;&#x529B;&#x8BA9;&#x5B83;&#x80FD;&#x5E2E;&#x4F60;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x7684;&#x4FE1;&#x606F;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x5B66;&#x4F1A;&#x4E86;&#x80CC;&#x540E;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x5C31;&#x80FD;&#x81EA;&#x5DF1;&#x53BB;&#x505A;&#x81EA;&#x5DF1;&#x7684;&#x6E38;&#x620F;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;QQ&#x5462;&#xFF1F;</p>
<p>&#x5176;&#x5B9E;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x5728;&#x4F60;&#x8F7B;&#x63CF;&#x6DE1;&#x5199;&#x7684;&#x52A8;&#x52A8;&#x9F20;&#x6807;&#x5C31;&#x5B8C;&#x6210;&#x7684;&#x80CC;&#x540E;&#xFF0C;&#x662F;&#x7531;&#x5927;&#x91CF;&#x6770;&#x51FA;&#x7684;&#x79D1;&#x5B66;&#x5BB6;&#x548C;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x7684;&#x8F9B;&#x52E4;&#x5DE5;&#x4F5C;&#x7684;&#x6210;&#x679C;&#xFF0C;&#x5B83;&#x4EEC;&#x5229;&#x7528;&#x7535;&#x5B50;&#x6280;&#x672F;&#x3001;&#x4FE1;&#x606F;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#x548C;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x8BA9;&#x8FD9;&#x4E00;&#x5207;&#x53D8;&#x5F97;&#x5982;&#x6B64;&#x6613;&#x7528;&#x548C;&#x666E;&#x901A;&#x3002;</p>
<hr>
<p>&#x90A3;&#x4E48;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5148;&#x804A;&#x804A;&#x7535;&#x8111;&#xFF0C;&#x4F60;&#x8BA4;&#x4E3A;&#x7535;&#x8111;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4EC0;&#x4E48;&#x624D;&#x7B97;&#x662F;&#x7535;&#x8111;&#x5462;&#xFF1F;&#x770B;&#x770B;&#x4E0B;&#x8FB9;&#x51E0;&#x5F20;&#x56FE;&#x5427;&#xFF0C;&#x4F60;&#x731C;&#x731C;&#x56FE;&#x4E2D;&#x54EA;&#x4E9B;&#x662F;&#x7535;&#x8111;&#xFF1A;</p>
<p><img src="http://wx3.sinaimg.cn/mw1024/006mou3Bly1fjlldwt2hfj30ia0iajud.jpg" alt="&#x731C;&#x731C;&#x770B;&#x8FD9;&#x91CC;&#x8FB9;&#x90A3;&#x4E9B;&#x662F;&#x7535;&#x8111;&#xFF1F;"></p>
<p>&#x5176;&#x5B9E;&#x4E0A;&#x8FB9;&#x7684;&#x90FD;&#x662F;&#x7535;&#x8111;&#xFF0C;&#x5BB6;&#x7528;&#x53F0;&#x5F0F;&#x673A;&#x548C;&#x7B14;&#x8BB0;&#x672C;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x4F46;&#x7B2C;&#x4E00;&#x56FE;&#x7684;&#x5DE5;&#x4E1A;&#x5C0F;&#x578B;&#x673A;&#x548C;&#x7B2C;&#x56DB;&#x56FE;&#x7684;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x5C31;&#x4E0D;&#x5E38;&#x89C1;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x8FDC;&#x8FDC;&#x4E0D;&#x6B62;&#x8FD9;&#x4E9B;&#xFF0C;&#x7535;&#x8111;&#x7684;&#x8303;&#x56F4;&#x6BD4;&#x4F60;&#x60F3;&#x8C61;&#x7684;&#x8FD8;&#x8981;&#x5E7F;&#x6CDB;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x7528;&#x7684;&#x624B;&#x673A;&#xFF0C;&#x6BCF;&#x8F86;&#x6C7D;&#x8F66;&#x4E0A;&#x90FD;&#x6709;&#x7BA1;&#x7406;&#x5239;&#x8F66;&#x548C;&#x7A7A;&#x8C03;&#x7684;&#x6C7D;&#x8F66;&#x7535;&#x8111;&#xFF0C;&#x53BB;&#x94F6;&#x884C;&#x53D6;&#x94B1;&#x7528;&#x5230;&#x7684;ATM&#xFF0C;&#x53BB;&#x8D85;&#x5E02;&#x4ED8;&#x6B3E;&#x65F6;&#x6536;&#x94F6;&#x5458;&#x64CD;&#x4F5C;&#x7684;&#x6536;&#x94F6;&#x673A;&#xFF0C;&#x751A;&#x81F3;&#x5C0F;&#x5230;&#x4F60;&#x73A9;&#x7684;&#x9065;&#x63A7;&#x73A9;&#x5177;&#x8F66;&#xFF0C;&#x53A8;&#x623F;&#x91CC;&#x7684;&#x7535;&#x78C1;&#x7089;&#x5FAE;&#x6CE2;&#x7089;&#x7B49;&#x7B49;&#x90FD;&#x53EF;&#x4EE5;&#x79F0;&#x4E4B;&#x4E3A;&#x7535;&#x8111;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x7EA6;&#x5B9A;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x7535;&#x8111;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x673A;&#x5668;&#xFF1A;<strong>&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x5B9E;&#x73B0;&#x67D0;&#x79CD;&#x6216;&#x591A;&#x79CD;&#x529F;&#x80FD;&#x7684;&#x7535;&#x5B50;&#x8BBE;&#x5907;</strong>&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x53E3;&#x8BED;&#x5316;&#x7684;&#x7535;&#x8111;&#x3002;</p>
<p>&#x662F;&#x4E0D;&#x662F;&#x6CA1;&#x60F3;&#x5230;&#x539F;&#x6765;&#x7535;&#x8111;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x5C0F;&#x5144;&#x5F1F;&#xFF0C;&#x4F60;&#x7684;&#x5468;&#x56F4;&#x9664;&#x4E86;&#x90A3;&#x4E2A;&#x56DB;&#x56DB;&#x65B9;&#x65B9;&#x7684;&#x5E26;&#x6709;&#x5C4F;&#x5E55;&#x7684;&#x673A;&#x5668;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x8BBE;&#x5907;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x7535;&#x8111;</p>
<p>&#x90A3;&#x4E48;&#x5C31;&#x6709;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E86;&#xFF0C;</p>

      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    

    

    </div>

    
  </div>
</article>


    </main>

    <footer class="site-footer">
  <p class="site-info">
    Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
    Theme by <a href="https://github.com/CodeDaraW/Hacker" target="_blank">Hacker</a>
    </br>
    
    &copy; 2017 13hoop
    
  </p>
</footer>
    
  </div>
</div>
</body>
</html>