<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>小朋友的编程二 | YongSir | 专业程序员伪装者</title>

  
  <meta name="author" content="13hoop">
  

  
  <meta name="description" content="&amp;#x4E00;&amp;#x5207;&amp;#x90FD;&amp;#x662F;&amp;#x6570;&amp;#x5B57;&amp;#x548C;&amp;#x7535;&amp;#x8DEF;&amp;#x6211;&amp;#x4EEC;&amp;#x4E0A;&amp;#x4E00;&amp;#x6B21;&amp;#x5927;&amp;#x81F4;&amp;#x5BF9;&amp;#x7535;&amp;#x811">
  

  
  
  <meta name="keywords" content="">
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="小朋友的编程二"/>

  <meta property="og:site_name" content="YongSir"/>

  
  <meta property="og:image" content="/favicon.ico"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="YongSir" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
</head>


<body>
<div class="blog">
  <div class="content">

    <header>
  <div class="site-branding">
    <h1 class="site-title">
      <a href="/">YongSir</a>
    </h1>
    <p class="site-description">专业程序员伪装者</p>
  </div>
  <nav class="site-navigation">
    <ul>
      
        <li><a href="/">主页</a></li>
      
        <li><a href="/archives">归档</a></li>
      
    </ul>
  </nav>
</header>

    <main class="site-main posts-loop">
    <article>

  
    
    <h3 class="article-title"><span>小朋友的编程二</span></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/2017/09/18/小朋友的编程-二/" rel="bookmark">
        <time class="entry-date published" datetime="2017-09-18T01:39:27.000Z">
          2017-09-18
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <h3 id="&#x4E00;&#x5207;&#x90FD;&#x662F;&#x6570;&#x5B57;&#x548C;&#x7535;&#x8DEF;"><a href="#&#x4E00;&#x5207;&#x90FD;&#x662F;&#x6570;&#x5B57;&#x548C;&#x7535;&#x8DEF;" class="headerlink" title="&#x4E00;&#x5207;&#x90FD;&#x662F;&#x6570;&#x5B57;&#x548C;&#x7535;&#x8DEF;"></a>&#x4E00;&#x5207;&#x90FD;&#x662F;&#x6570;&#x5B57;&#x548C;&#x7535;&#x8DEF;</h3><p>&#x6211;&#x4EEC;&#x4E0A;&#x4E00;&#x6B21;&#x5927;&#x81F4;&#x5BF9;&#x7535;&#x8111;&#x4EE5;&#x53CA;&#x7F16;&#x7A0B;&#x7684;&#x6982;&#x5FF5;&#x6709;&#x4E86;&#x4E00;&#x4E9B;&#x4E86;&#x89E3;&#xFF0C;&#x7F16;&#x7A0B;&#x5C31;&#x50CF;&#x662F;&#x8DDF;&#x673A;&#x5668;&#x8BF4;&#x8BDD;&#xFF0C;&#x544A;&#x8BC9;&#x673A;&#x5668;&#x6309;&#x7167;&#x6211;&#x4EEC;&#x8BBE;&#x8BA1;&#x7684;&#x6D41;&#x7A0B;&#x53BB;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x7535;&#x8111; = &#x7535;&#x5B50;&#x5143;&#x4EF6; + &#x7A0B;&#x5E8F; = &#x786C;&#x4EF6; + &#x8F6F;&#x4EF6;&#x3002; &#x8FD9;&#x4E00;&#x8282;&#x5C31;&#x5728;&#x5177;&#x4F53;&#x8BF4;&#x8BF4;&#x4E3A;&#x4EC0;&#x4E48;&#x7535;&#x8111;&#x9664;&#x4E86;&#x9700;&#x8981;&#x786C;&#x4EF6;&#x4E4B;&#x5916;&#x8FD8;&#x9700;&#x8981;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x8FD9;&#x8FD8;&#x5F97;&#x4ECE;&#x7535;&#x8DEF;&#x5F00;&#x59CB;&#x8BF4;&#x8D77;&#xFF0C;&#x6211;&#x8DDF;&#x4F60;&#x63D0;&#x5230;&#x8FC7;&#x7535;&#x8DEF;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;2&#x7C7B;&#x3002;&#x4E00;&#x79CD;&#x53EB;<code>&#x6570;&#x5B57;&#x7535;&#x8DEF;</code>,&#x5B83;&#x51FA;&#x73B0;&#x7684;&#x6BD4;&#x8F83;&#x665A;&#x662F;&#x4E2A;&#x5C0F;&#x5F1F;&#xFF0C;&#x5B83;&#x7684;&#x5927;&#x54E5;&#x662F;&#x4E00;&#x4E2A;&#x53EB;<code>&#x6A21;&#x62DF;&#x7535;&#x8DEF;</code>&#x7684;&#x5BB6;&#x4F19;&#xFF0C;&#x8FD9;&#x5BB6;&#x4F19;&#x4ECE;&#x4EBA;&#x7C7B;&#x8BA4;&#x8BC6;&#x548C;&#x4F7F;&#x7528;&#x7535;&#x4EE5;&#x6765;&#xFF0C;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x5B83;&#xFF0C;&#x6BD4;&#x5982;&#x4F5C;&#x4E3A;&#x80FD;&#x6E90;&#x4F9B;&#x5E94;&#x9A71;&#x52A8;&#x7535;&#x673A;&#xFF0C;&#x706F;&#x6CE1;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x6211;&#x8FD8;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x7535;&#x4E0D;&#x5149;&#x662F;&#x4E00;&#x79CD;&#x80FD;&#x91CF;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x79CD;&#x4FE1;&#x606F;&#xFF0C;&#x6240;&#x4EE5;&#x6A21;&#x62DF;&#x7535;&#x8DEF;&#x548C;&#x6570;&#x5B57;&#x7535;&#x8DEF;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x6700;&#x6839;&#x672C;&#x7684;&#x6765;&#x8BF4;&#x5C31;&#x662F;2&#x8005;&#x7535;&#x8DEF;&#x4E2D;&#x7684;&#x4FE1;&#x53F7;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x7535;&#x8DEF;&#x677F;&#x5982;&#x679C;&#x5B83;&#x91CC;&#x9762;&#x7684;&#x4FE1;&#x53F7;&#x662F;&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#xFF0C;&#x90A3;&#x5B83;&#x5C31;&#x662F;&#x6570;&#x5B57;&#x7535;&#x8DEF;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x662F;&#x6A21;&#x62DF;&#x7535;&#x8DEF;&#x3002;</p>
<p>&#x7B80;&#x5355;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x968F;&#x5904;&#x53EF;&#x89C1;&#x7684;&#x81EA;&#x7136;&#x4FE1;&#x53F7;&#x90FD;&#x6A21;&#x62DF;&#x4FE1;&#x53F7;&#xFF0C;&#x6BD4;&#x5982;&#x58F0;&#x97F3;&#x4FE1;&#x53F7;&#xFF0C;&#x706F;&#x5149;&#x7B49;&#x7B49;&#xFF0C;&#x6A21;&#x62DF;&#x4FE1;&#x53F7;&#x7684;&#x7279;&#x70B9;&#x5C31;&#x662F;&#x5728;&#x65F6;&#x95F4;&#x4E0A;&#x548C;&#x53D6;&#x503C;&#x4E0A;&#x90FD;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#x4E0D;&#x95F4;&#x65AD;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x4F60;&#x5B66;&#x8FC7;&#x7684;&#x6570;&#x8F74;&#x4E0A;&#xFF0C;&#x968F;&#x610F;&#x753B;&#x51FA;&#x6765;&#x5C31;&#x662F;&#x4E00;&#x6761;&#x8FDE;&#x7EED;&#x4E0D;&#x95F4;&#x65AD;&#x7684;&#x66F2;&#x7EBF;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x800C;&#x81EA;&#x7136;&#x7684;&#x6A21;&#x62DF;&#x4FE1;&#x53F7;&#x3002;</p>
<p>&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#x5C31;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#xFF0C;&#x5728;&#x65F6;&#x95F4;&#x4E0A;&#x548C;&#x53D6;&#x503C;&#x4E0A;&#x90FD;&#x662F;&#x4E0D;&#x8FDE;&#x7EED;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x8BF4;&#x8D77;&#x6765;&#x6709;&#x4E9B;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;&#x56FE;&#x5C31;&#x770B;&#x51FA;&#x6765;&#x7684;&#xFF1A;<br><img src="http://wx3.sinaimg.cn/mw1024/006mou3Bgy1fjtkw1x0w0g30b607xdfq.gif" alt=""></p>
<p>&#x8FD9;&#x662F;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x56FE;&#xFF0C;&#x8FD8;&#x6709;&#x66F4;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#x7684;&#xFF0C;&#x4F60;&#x80FD;&#x4E0D;&#x80FD;&#x5224;&#x65AD;&#x90A3;&#x4E9B;&#x662F;&#x6A21;&#x62DF;&#x7684;&#x90A3;&#x4E9B;&#x662F;&#x6570;&#x5B57;&#x7684;&#x5462;&#xFF1F;<br><img src="http://wx1.sinaimg.cn/mw1024/006mou3Bgy1fjtlemadohj31040ywq7n.jpg" alt=""></p>
<p>&#x5176;&#x5B9E;&#x5173;&#x952E;&#x5C31;&#x662F;&#x770B;&#x4FE1;&#x53F7;&#x56FE;&#x662F;&#x5426;&#x8FDE;&#x7EED;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x95F4;&#x65AD;&#x90A3;&#x5C31;&#x662F;&#x6A21;&#x62DF;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x67F1;&#x5B50;&#x4E00;&#x6837;&#x7684;&#x4E1C;&#x897F;&#x90A3;&#x5C31;&#x662F;&#x6570;&#x5B57;&#x7684;&#x3002;</p>
<p>&#x65E2;&#x7136;&#x6A21;&#x62DF;&#x4FE1;&#x53F7;&#x53C8;&#x81EA;&#x7136;&#x5E94;&#x7528;&#x7684;&#x53C8;&#x65E9;&#xFF0C;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x73B0;&#x5728;&#x4E3B;&#x6D41;&#x90FD;&#x662F;&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#x5462;&#xFF1F;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x518D;&#x4E0A;&#x56FE;&#x4E2D;&#x4F60;&#x5C31;&#x80FD;&#x731C;&#x51FA;&#x4E00;&#x4E9B;&#xFF0C;&#x539F;&#x56E0;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x6700;&#x5173;&#x952E;&#x7684;&#x662F;&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#x7B80;&#x5355;&#xFF0C;&#x89C4;&#x5F8B;&#x6027;&#x5F3A;&#xFF0C;&#x7B80;&#x5355;&#x5C31;&#x610F;&#x5473;&#x7740;&#x7528;&#x7535;&#x91CF;&#x5C11;&#xFF0C;&#x6709;&#x89C4;&#x5F8B;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5904;&#x7406;&#x5F88;&#x4F20;&#x8F93;&#x65B9;&#x4FBF;&#xFF0C;&#x6240;&#x4EE5;&#x6570;&#x5B57;&#x7535;&#x8DEF;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x5F88;&#x5C0F;&#x5F88;&#x5F3A;&#xFF0C;&#x6211;&#x4EEC;&#x63A5;&#x7740;&#x56FE;&#xFF1A;</p>
<p><img src="http://wx2.sinaimg.cn/mw1024/006mou3Bgy1fjtluehv9pj30ri0drgnh.jpg" alt=""><br>&#x4E0A;&#x56FE;&#x5DE6;&#x4FA7;&#x662F;&#x65E9;&#x671F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x786C;&#x4EF6;&#x4E3B;&#x8981;&#x90FD;&#x662F;&#x6A21;&#x62DF;&#x7535;&#x8DEF;&#xFF0C;&#x800C;&#x53F3;&#x4FA7;&#x4F60;&#x5C31;&#x5F88;&#x719F;&#x6089;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x666E;&#x901A;&#x7684;&#x5BB6;&#x7528;&#x7535;&#x8111;&#xFF0C;&#x524D;&#x8005;&#x6709;&#x51E0;&#x4E2A;&#x5C4B;&#x5B50;&#x5927;&#x5C0F;&#x800C;&#x540E;&#x8005;&#x684C;&#x4E0A;&#x5C31;&#x80FD;&#x653E;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x4F53;&#x79EF;&#x5DEE;&#x5F02;&#x5B83;&#x4EEC;&#x7684;&#x529F;&#x80FD;&#x5F3A;&#x5F31;&#x624D;&#x662F;&#x66F4;&#x8BA9;&#x4EBA;&#x60CA;&#x5947;&#x7684;&#xFF0C;&#x540E;&#x8005;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x6BD4;&#x524D;&#x8005;&#x8981;&#x5F3A;<strong>&#x597D;&#x51E0;&#x767E;&#x4E07;&#x500D;</strong>&#x90FD;&#x4E0D;&#x6B62;&#xFF0C;&#x5373;&#x4FBF;&#x4F60;&#x7684;&#x624B;&#x673A;&#x7684;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x4E5F;&#x8981;&#x6BD4;&#x5C4B;&#x5B50;&#x4E00;&#x6837;&#x7684;&#x8001;&#x7535;&#x8111;&#x5F3A;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x73B0;&#x5728;&#x6570;&#x5B57;&#x7535;&#x8DEF;&#x88AB;&#x5E7F;&#x6CDB;&#x7684;&#x4F7F;&#x7528;&#x5728;&#x5404;&#x4E2A;&#x9886;&#x57DF;&#xFF0C;&#x7535;&#x8111;&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x6700;&#x5178;&#x578B;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
<hr>
<p>&#x4E86;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x56DE;&#x5230;&#x4E3B;&#x9898;&#xFF0C;&#x7535;&#x8111; = &#x786C;&#x4EF6; + &#x8F6F;&#x4EF6;&#xFF0C;&#x5176;&#x4E2D;&#x786C;&#x4EF6;&#x6307;&#x7684;&#x662F;&#x6570;&#x5B57;&#x7535;&#x8DEF;&#xFF0C;&#x90A3;&#x4E48;&#x8F6F;&#x4EF6;&#x5462;&#xFF1F;</p>
<p>&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x597D;&#x56DE;&#x5230;&#x6570;&#x5B57;&#x4E5F;&#x662F;&#x4FE1;&#x606F;&#x7684;&#x90A3;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x5427;&#xFF1A;<br>&#x6BD4;&#x5982;&#x6211;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7535;&#x538B;5v&#xFF0C;&#x5982;&#x679C;&#x6BD4;5&#x5C0F;&#x7684;&#x7535;&#x538B;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x4F4E;&#x7535;&#x538B;&#xFF0C;&#x6211;&#x4EEC;&#x7528;0&#x8868;&#x793A;&#xFF0C;&#x6BD4;&#x5B83;&#x9AD8;&#x5C31;&#x662F;&#x9AD8;&#x7535;&#x538B;&#xFF0C;&#x6211;&#x4EEC;&#x7528;1&#x8868;&#x793A;&#x3002;&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x8FD8;&#x89C4;&#x5B9A;&#xFF0C;&#x5982;&#x679C;&#x9AD8;&#x7535;&#x538B;&#x5C31;&#x4EE3;&#x8868;&#x5929;&#x6C14;&#x6674;&#x6717;&#x9002;&#x5408;&#x51FA;&#x95E8;&#x73A9;&#xFF0C;&#x4F4E;&#x7535;&#x538B;&#x4E3A;&#x96E8;&#x5929;&#x4E0D;&#x80FD;&#x51FA;&#x95E8;&#xFF0C;&#x6587;&#x5B57;&#x63CF;&#x8FF0;&#x5BF9;&#x5E94;&#x5230;&#x8868;&#x683C;&#x5C31;&#x662F;&#xFF1A;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x5927;&#x4E8E;5V</th>
<th style="text-align:center">1</th>
<th style="text-align:center">&#x5929;&#x6C14;&#x6674;&#x6717;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">&#x5C0F;&#x4E8E;5V</td>
<td style="text-align:center">0</td>
<td style="text-align:center">&#x9634;&#x96E8;&#x5929;&#x6C14;</td>
</tr>
</tbody>
</table>
<p>&#x90A3;&#x4E48;&#x5982;&#x679C;&#x7ED9;&#x51FA;&#x7684;&#x662F;<code>1</code>&#xFF0C;&#x4F60;&#x4E00;&#x770B;&#x81EA;&#x7136;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#xFF1A;&#x5662;&#xFF0C;&#x4ECA;&#x5929;&#x5929;&#x6E05;&#x6C14;&#x6717;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x51FA;&#x53BB;&#x6E38;&#x73A9;&#xFF0C;<code>0</code>&#x7684;&#x8BDD;&#x5C31;&#x6B63;&#x597D;&#x76F8;&#x53CD;&#x3002;&#x4E0A;&#x8FF0;&#x5C31;&#x901A;&#x8FC7;&#x628A;<code>&#x7535;&#x538B;</code>&#x8F6C;&#x5316;&#x6210;&#x4E86;&#x6570;&#x5B57;&#x4FE1;&#x53F7;<code>0&#x6216;1</code>&#xFF08;&#x8FD9;&#x4E00;&#x6B65;&#x662F;&#x786C;&#x4EF6;&#x5728;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x6765;0&#x8868;&#x793A;&#x9634;&#x96E8;&#x5E76;&#x8BA9;1&#x8868;&#x793A;&#x6674;&#x5929;&#xFF08;&#x8FD9;&#x4E2A;&#x89C4;&#x5B9A;&#x8C01;&#x4EE3;&#x8868;&#x8C01;&#x5C31;&#x5C5E;&#x4E8E;&#x8F6F;&#x4EF6;&#x7684;&#x5DE5;&#x4F5C;&#xFF09;&#xFF0C;&#x4ED6;&#x4EEC;&#x5171;&#x540C;&#x4F5C;&#x7528;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x8868;&#x793A;&#x5929;&#x6C14;&#x7684;&#x597D;&#x574F;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x6269;&#x5C55;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x79D1;&#x5B66;&#x5BB6;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x79CD;&#x6750;&#x6599;&#xFF0C;&#x5B83;&#x505A;&#x6210;&#x7684;&#x7535;&#x8DEF;&#x80FD;&#x6839;&#x636E;&#x5929;&#x6C14;&#x7684;&#x597D;&#x574F;&#x800C;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x96E8;&#x5929;&#x4F4E;&#x4E8E;5v&#xFF0C;&#x6674;&#x5929;&#x5C31;&#x9AD8;&#x4E8E;5v&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x79CD;&#x6750;&#x6599;&#x505A;&#x7684;&#x7535;&#x8DEF;&#x653E;&#x5230;&#x9662;&#x5B50;&#x91CC;&#xFF0C;&#x4F60;&#x53EA;&#x7528;&#x5728;&#x5C4F;&#x5E55;&#x524D;&#x53BB;&#x770B;&#x663E;&#x793A;0&#x6216;&#x8005;1&#xFF0C;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#x5929;&#x6C14;&#xFF0C;&#x4E0D;&#x7528;&#x81EA;&#x5DF1;&#x51FA;&#x53BB;&#x770B;&#xFF0C;&#x5E76;&#x4E14;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x81EA;&#x52A8;&#x5316;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4E00;&#x65E6;&#x5DF2;&#x4F60;&#x7B2C;&#x4E00;&#x6B21;&#x5E03;&#x7F6E;&#x597D;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x518D;&#x4E5F;&#x4E0D;&#x7528;&#x53BB;&#x5E72;&#x9884;&#x4E86;&#xFF0C;&#x4F60;&#x5C31;&#x62E5;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x80FD;&#x81EA;&#x52A8;&#x544A;&#x8BC9;&#x4F60;&#x5929;&#x6C14;&#x7684;&#x667A;&#x80FD;&#x8BBE;&#x5907;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x8F6F;&#x4EF6;+&#x786C;&#x4EF6;&#x4E4B;&#x6240;&#x4EE5;&#x5389;&#x5BB3;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5B83;&#x4EEC;&#x914D;&#x5408;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x81EA;&#x52A8;&#x7684;&#xFF0C;&#x667A;&#x80FD;&#x7684;&#x3002;</p>
<p>&#x770B;&#x8D77;&#x6765;&#x4E5F;&#x4E0D;&#x662F;&#x592A;&#x96BE;&#xFF0C;&#x662F;&#x5427;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x4F60;&#x5BF9;&#x8F6F;&#x4EF6;&#x548C;&#x786C;&#x4EF6;&#x591A;&#x4E86;&#x89E3;&#x4E86;&#x4E00;&#x4E9B;&#xFF1A;</p>
<ul>
<li>&#x7535;&#x8111;&#x91CC;&#x7684;&#x786C;&#x4EF6;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x6570;&#x5B57;&#x7535;&#x8DEF;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x6570;&#x5B57;&#x4FE1;&#x53F7;</li>
<li>&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#x4E0D;&#x662F;0&#x5C31;&#x662F;1&#xFF0C;&#x7535;&#x8111;&#x4E2D;&#x7684;&#x4E00;&#x5207;&#x672C;&#x8D28;&#x4E0A;&#x90FD;&#x662F;0&#x548C;1&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x56FE;&#x7247;&#x89C6;&#x5C4F;&#x8FD8;&#x662F;&#x6E38;&#x620F;</li>
<li>&#x8F6F;&#x4EF6;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x548C;&#x89E3;&#x91CA;&#x786C;&#x4EF6;&#x7684;&#xFF0C;&#x5B83;&#x89C4;&#x5B9A;01&#x4EE3;&#x8868;&#x4E86;&#x4EC0;&#x4E48;</li>
</ul>
<p>&#x8FD9;&#x8FD8;&#x662F;&#x4E00;&#x7BC7;&#x6982;&#x5FF5;&#x6027;&#x7684;&#x6750;&#x6599;&#xFF0C;&#x770B;&#x8FC7;&#x6709;&#x4E2A;&#x5370;&#x8C61;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x80FD;&#x4E86;&#x89E3;&#x5230;&#x7535;&#x8111;&#x4E2D;&#x7684;&#x4E00;&#x5207;&#x90FD;&#x662F;0101&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C31;&#x662F;&#x7535;&#x8111;&#x5DE5;&#x4F5C;&#x7684;&#x57FA;&#x672C;&#x673A;&#x5236;&#x3002;&#x9884;&#x544A;&#x4E00;&#x4E0B;&#xFF1A;&#x4E0B;&#x5468;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x5F00;&#x59CB;&#x8BD5;&#x8BD5;&#x6700;&#x7B80;&#x5355;&#x7684;&#x7F16;&#x7A0B;&#x4E86;&#x3002;</p>

      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    

    

    </div>

    
  </div>
</article>


    </main>

    <footer class="site-footer">
  <p class="site-info">
    Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
    Theme by <a href="https://github.com/CodeDaraW/Hacker" target="_blank">Hacker</a>
    </br>
    
    &copy; 2017 13hoop
    
  </p>
</footer>
    
  </div>
</div>
</body>
</html>